<a href="https://colab.research.google.com/github/sebakrys/data-science-bootcamp-A-Z/blob/main/04_pandas_pt1_intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [33]:
import pandas as pd
pd.__version__

'2.1.4'

## Series

In [34]:
s = pd.Series(data=[3, 2, 4, 6])
s

0    3
1    2
2    4
3    6
dtype: int64

In [35]:
s = pd.Series(data=[3, 2, 4, 6], index=["a", "b", "c", "d"], name="Sample")
s

a    3
b    2
c    4
d    6
Name: Sample, dtype: int64

In [36]:
s = pd.Series(data=[3., 2, 4, 6], index=["a", "b", "c", "d"], name="sample")
s

a    3.0
b    2.0
c    4.0
d    6.0
Name: sample, dtype: float64

In [37]:
import numpy as np

s = pd.Series(data=[3., np.nan, 4, 6], index=["a", "b", "c", "d"], name="sample")
s

a    3.0
b    NaN
c    4.0
d    6.0
Name: sample, dtype: float64

In [38]:
s = pd.Series(data=[True, False, True])
s

0     True
1    False
2     True
dtype: bool

In [39]:
s = pd.Series(data=np.arange(10, 20), index=pd.date_range(start='20200101', periods=10))
s

2020-01-01    10
2020-01-02    11
2020-01-03    12
2020-01-04    13
2020-01-05    14
2020-01-06    15
2020-01-07    16
2020-01-08    17
2020-01-09    18
2020-01-10    19
Freq: D, dtype: int64

In [40]:
list(s.index)

[Timestamp('2020-01-01 00:00:00'),
 Timestamp('2020-01-02 00:00:00'),
 Timestamp('2020-01-03 00:00:00'),
 Timestamp('2020-01-04 00:00:00'),
 Timestamp('2020-01-05 00:00:00'),
 Timestamp('2020-01-06 00:00:00'),
 Timestamp('2020-01-07 00:00:00'),
 Timestamp('2020-01-08 00:00:00'),
 Timestamp('2020-01-09 00:00:00'),
 Timestamp('2020-01-10 00:00:00')]

In [41]:
s = pd.Series(data=['python', 'java', 'c++', 'sql'], name='languages')
s

0    python
1      java
2       c++
3       sql
Name: languages, dtype: object

In [42]:
type(s)

pandas.core.series.Series

In [43]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
s.values

array(['python', 'java', 'c++', 'sql'], dtype=object)

In [45]:
s.dtypes

dtype('O')

In [46]:
s.shape

(4,)

In [47]:
price = pd.Series(data={'Apple':200, 'CD Projekt':60, 'Amazon':1900, 'KGHM':np.nan})
price

Apple          200.0
CD Projekt      60.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [48]:
price['CD Projekt']

60.0

In [49]:
print(price[1])

60.0

<ipython-input-49-c91d6da71123>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(price[1])

In [50]:
print(price.iloc[1])

60.0

In [51]:
price.count()

3

In [57]:
price.value_counts(dropna=False)

200.0     1
60.0      1
1900.0    1
NaN       1
Name: count, dtype: int64

In [53]:
price.sum()

2160.0

In [54]:
price.min()

60.0

In [55]:
price.std()

1024.3046421841502

In [56]:
price.describe()

count       3.000000
mean      720.000000
std      1024.304642
min        60.000000
25%       130.000000
50%       200.000000
75%      1050.000000
max      1900.000000
dtype: float64

In [58]:
price.nlargest(2)

Amazon    1900.0
Apple      200.0
dtype: float64

In [59]:
price.nsmallest(1)

CD Projekt    60.0
dtype: float64

In [60]:
price.rank()

Apple         2.0
CD Projekt    1.0
Amazon        3.0
KGHM          NaN
dtype: float64

In [61]:
price.sort_values()

CD Projekt      60.0
Apple          200.0
Amazon        1900.0
KGHM             NaN
dtype: float64

In [62]:
price.sort_values(ascending=False)

Amazon        1900.0
Apple          200.0
CD Projekt      60.0
KGHM             NaN
dtype: float64

In [64]:
price.apply(lambda x: x * 3.8)

Apple          760.0
CD Projekt     228.0
Amazon        7220.0
KGHM             NaN
dtype: float64

In [67]:
price_pln = price.apply(lambda x: x * 3.8)
price_pln

Apple          760.0
CD Projekt     228.0
Amazon        7220.0
KGHM             NaN
dtype: float64

## DataFrame